Autodesk.Revit.DB.DimensionTypeSet
A set that contains dimension types.

Autodesk.Revit.DB.DimensionTypeSet.Insert(Autodesk.Revit.DB.DimensionType)
System.Int32
Insert the specified dimension type into the set.
item: The dimension type to be inserted into the set.
Returns: Returns whether the dimension type was inserted into the set.

Autodesk.Revit.DB.DimensionTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.DimensionTypeSet.ReverseIterator
Autodesk.Revit.DB.DimensionTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.DimensionTypeSet.ForwardIterator
Autodesk.Revit.DB.DimensionTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.DimensionTypeSet.Erase(Autodesk.Revit.DB.DimensionType)
System.Int32
Removes a specified dimension type from the set.
item: The dimension type to be erased.
Returns: The number of dimension types that were erased from the set.

Autodesk.Revit.DB.DimensionTypeSet.Contains(Autodesk.Revit.DB.DimensionType)
System.Boolean
Tests for the existence of a dimension type within the set.
item: The dimension type to be searched for.
Returns: The Contains method returns True if the dimension type is within the set, otherwise False.

Autodesk.Revit.DB.DimensionTypeSet.Clear
void
Removes every dimension type from the set, rendering it empty.

Autodesk.Revit.DB.DimensionTypeSet.Size
System.Int32
get
Returns the number of dimension types that are in the set.

Autodesk.Revit.DB.DimensionTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.